<template>
  <div>
    <h1 style="color: #273849">List Component</h1>
    <div>
      <q-list direction="t2b">
        <div slot="list" v-for="(item, index) in lists" :key="index">
          <p>{{item}}</p>
        </div>
      </q-list>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      lists: [
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本1',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本2',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本3',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本4',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本5',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本6',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本7',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本8',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本9',
        '我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本我是一段展示的文本10'
      ]
    }
  }
}
</script>

<style>

</style>
